2zzyyyq/3C/n32g033_std_periph_driver/inc/n32g033_tim.h
/** TIM_Output_Compare_N_state **/
#define TIM_OUTPUT_NSTATE_DISABLE          (TIM_REG_BIT_MASK)
#define TIM_OUTPUT_NSTATE_ENABLE           (TIM_CCEN_CC1NEN)

/** TIM_Output_Compare_Polarity **/
#define TIM_OC_POLARITY_HIGH               (TIM_REG_BIT_MASK)
#define TIM_OC_POLARITY_LOW                (TIM_CCEN_CC1P)

/** TIM_Output_Compare_N_Polarity **/
#define TIM_OCN_POLARITY_HIGH              (TIM_REG_BIT_MASK)
#define TIM_OCN_POLARITY_LOW               (TIM_CCEN_CC1NP)

/** TIM_Output_Compare_Idle_State **/
#define TIM_OC_IDLE_STATE_SET              (TIM_CTRL2_OI1)
#define TIM_OC_IDLE_STATE_RESET            (TIM_REG_BIT_MASK)

/** TIM_Output_Compare_N_Idle_State **/
#define TIM_OCN_IDLE_STATE_SET             (TIM_CTRL2_OI1N)
#define TIM_OCN_IDLE_STATE_RESET           (TIM_REG_BIT_MASK)

/** TIM_Channel **/
#define TIM_CH_1                           ((uint32_t)0x00000000)
#define TIM_CH_2                           ((uint32_t)0x00000004)
#define TIM_CH_3                           ((uint32_t)0x00000008)
#define TIM_CH_4                           ((uint32_t)0x0000000C)
#define TIM_CH_5                           ((uint32_t)0x00000010)
#define TIM_CH_6                           ((uint32_t)0x00000014)
#define TIM_CH_7                           ((uint32_t)0x00000016)

/** TIM_Iutput_Capture_Polarity **/
#define TIM_IC_POLARITY_RISING             (TIM_REG_BIT_MASK)
#define TIM_IC_POLARITY_FALLING            (TIM_CCEN_CC1P)

/** TIM_Input_Capture_Selection **/
#define TIM_IC_SELECTION_DIRECTTI          (TIM_CCMOD1_CC1SEL_0) /* TIM Input 1, 2, 3 or 4 is selected to be 
                                                                    connected to IC1, IC2, IC3 or IC4, respectively */
#define TIM_IC_SELECTION_INDIRECTTI        (TIM_CCMOD1_CC1SEL_1) /* TIM Input 1, 2, 3 or 4 is selected to be 
                                                                    connected to IC2, IC1, IC4 or IC3, respectively. */
#define TIM_IC_SELECTION_TRC               (TIM_CCMOD1_CC1SEL) /* TIM Input 1, 2, 3 or 4 is selected to be connected to TRC. */

/** TIM_Input_Capture_Prescaler **/
#define TIM_IC_PSC_DIV1                    (TIM_REG_BIT_MASK) /* Capture performed each time an edge is detected on the capture input. */
#define TIM_IC_PSC_DIV2                    (TIM_CCMOD1_IC1PSC_0) /* Capture performed once every 2 events. */
#define TIM_IC_PSC_DIV4                    (TIM_CCMOD1_IC1PSC_1) /* Capture performed once every 4 events. */
#define TIM_IC_PSC_DIV8                    (TIM_CCMOD1_IC1PSC) /* Capture performed once every 8 events. */

/** OSSR_Off_State_Selection_for_Run_mode_state **/
#define TIM_OSSR_STATE_ENABLE              (TIM_BKDT_OSSR)
#define TIM_OSSR_STATE_DISABLE             (TIM_REG_BIT_MASK)

/** OSSI_Off_State_Selection_for_Idle_mode_state **/
#define TIM_OSSI_STATE_ENABLE               (TIM_BKDT_OSSI)
#define TIM_OSSI_STATE_DISABLE              (TIM_REG_BIT_MASK)

/** Lock_level **/
#define TIM_LOCK_LEVEL_OFF                  (TIM_REG_BIT_MASK)
#define TIM_LOCK_LEVEL_1                    (TIM_BKDT_LCKCFG_0)
#define TIM_LOCK_LEVEL_2                    (TIM_BKDT_LCKCFG_1)
#define TIM_LOCK_LEVEL_3                    (TIM_BKDT_LCKCFG)

/** Break_Input_enable_disable **/
#define TIM_BREAK_IN_ENABLE                 (TIM_BKDT_BKEN)
#define TIM_BREAK_IN_DISABLE                (TIM_REG_BIT_MASK)

/** Break_Polarity **/
#define TIM_BREAK_POLARITY_LOW              (TIM_REG_BIT_MASK)
#define TIM_BREAK_POLARITY_HIGH             (TIM_BKDT_BKP)

/** TIM_AOEN_Bit_Set_Reset **/
#define TIM_AUTO_OUTPUT_ENABLE              (TIM_BKDT_AOEN)
#define TIM_AUTO_OUTPUT_DISABLE             (TIM_REG_BIT_MASK)

/** Break1 input source **/
#define TIM_BREAK_LOCKUP                    (TIM_CTRL1_LBKPEN)
#define TIM_BREAK_PVD                       (TIM_CTRL1_PBKPEN)
#define TIM_BREAK_IOM1                      (TIM_AF1_IOM1BRKEN)
#define TIM_BREAK_COMP1                     (TIM_AF1_COMP1BRKEN)
#define TIM_BREAK_IOM2                      (TIM_AF1_IOM2BRKEN)
#define TIM_BREAK_IOM3                      (TIM_AF1_IOM3BRKEN)
#define TIM_BREAK_IOM4                      (TIM_AF1_IOM4BRKEN)

/** System break input **/
#define IS_SYS_BREAK(SOURCE)                (((SOURCE) == TIM_BREAK_LOCKUP)  || \
                                             ((SOURCE) == TIM_BREAK_PVD))

 /** Polarity of break input **/
#define TIM_BREAK_IOM1P                      (TIM_AF1_IOM1BRKP)
#define TIM_BREAK_COMP1P                     (TIM_AF1_COMP1BRKP)
#define TIM_BREAK_IOM2P                      (TIM_AF1_IOM2BRKP)
#define TIM_BREAK_IOM3P                      (TIM_AF1_IOM3BRKP)
#define TIM_BREAK_IOM4P                      (TIM_AF1_IOM4BRKP)
#define TIM_BREAK_IOM1_POLARITY_INVERT       (0x00000001U)
#define TIM_BREAK_IOM2_POLARITY_NONINVERT    (0x00000000U)

/** TIM_interrupt_sources **/
#define TIM_INT_CC1                         (TIM_DINTEN_CC1IEN)
#define TIM_INT_CC2                         (TIM_DINTEN_CC2IEN)
#define TIM_INT_CC3                         (TIM_DINTEN_CC3IEN)
#define TIM_INT_CC4                         (TIM_DINTEN_CC4IEN)
#define TIM_INT_CC5                         (TIM_DINTEN_CC5IEN)
#define TIM_INT_CC6                         (TIM_DINTEN_CC6IEN)
#define TIM_INT_CC7                         (TIM_DINTEN_CC7IEN)
#define TIM_INT_C3LDCNT                     (TIM_DINTEN_C3LDCNTIEN)
#define TIM_INT_UPDATE                      (TIM_DINTEN_UIEN)
#define TIM_INT_TRIG                        (TIM_DINTEN_TIEN)
#define TIM_INT_BREAK                       (TIM_DINTEN_BIEN)
#define TIM_INT_COM                         (TIM_DINTEN_COMIEN)

/** TIM_Event_Source **/
#define TIM_EVT_SRC_CC1                     (TIM_EVTGEN_CC1GN)
#define TIM_EVT_SRC_CC2                     (TIM_EVTGEN_CC2GN)
#define TIM_EVT_SRC_CC3                     (TIM_EVTGEN_CC3GN)
#define TIM_EVT_SRC_CC4                     (TIM_EVTGEN_CC4GN)
#define TIM_EVT_SRC_UPDATE                  (TIM_EVTGEN_UDGN)
#define TIM_EVT_SRC_COM                     (TIM_EVTGEN_CCUDGN)
#define TIM_EVT_SRC_TRIG                    (TIM_EVTGEN_TGN)
#define TIM_EVT_SRC_BREAK                   (TIM_EVTGEN_BGN)

/** TIM_DMA_Base_address **/
#define TIM_DMABASE_CTRL1                   (TIM_REG_BIT_MASK)
#define TIM_DMABASE_CTRL2                   (TIM_DCTRL_DBADDR_0)
#define TIM_DMABASE_STS                     (TIM_DCTRL_DBADDR_1)
#define TIM_DMABASE_EVTGEN                  (TIM_DCTRL_DBADDR_0 | TIM_DCTRL_DBADDR_1)
#define TIM_DMABASE_SMCTRL                  (TIM_DCTRL_DBADDR_2)
#define TIM_DMABASE_DMAINTEN                (TIM_DCTRL_DBADDR_0 | TIM_DCTRL_DBADDR_2)
#define TIM_DMABASE_CAPCMPMOD1              (TIM_DCTRL_DBADDR_1 | TIM_DCTRL_DBADDR_2)
#define TIM_DMABASE_CAPCMPMOD2              (TIM_DCTRL_DBADDR_0 | TIM_DCTRL_DBADDR_1 | TIM_DCTRL_DBADDR_2)
#define TIM_DMABASE_CAPCMPMOD3              (TIM_DCTRL_DBADDR_3)
#define TIM_DMABASE_CAPCMPEN                (TIM_DCTRL_DBADDR_0 | TIM_DCTRL_DBADDR_3)
#define TIM_DMABASE_CAPCMPDAT1              (TIM_DCTRL_DBADDR_1 | TIM_DCTRL_DBADDR_3)
#define TIM_DMABASE_CAPCMPDAT2              (TIM_DCTRL_DBADDR_0 | TIM_DCTRL_DBADDR_1 | TIM_DCTRL_DBADDR_3)
#define TIM_DMABASE_CAPCMPDAT3              (TIM_DCTRL_DBADDR_2 | TIM_DCTRL_DBADDR_3)
#define TIM_DMABASE_CAPCMPDAT4              (TIM_DCTRL_DBADDR_0 | TIM_DCTRL_DBADDR_2 | TIM_DCTRL_DBADDR_3)
#define TIM_DMABASE_CAPCMPDAT5              (TIM_DCTRL_DBADDR_1 | TIM_DCTRL_DBADDR_2 | TIM_DCTRL_DBADDR_3)
#define TIM_DMABASE_CAPCMPDAT6              (TIM_DCTRL_DBADDR_0 | TIM_DCTRL_DBADDR_1 | TIM_DCTRL_DBADDR_2 | TIM_DCTRL_DBADDR_3)
#define TIM_DMABASE_PSC                     (TIM_DCTRL_DBADDR_4)
#define TIM_DMABASE_AR                      (TIM_DCTRL_DBADDR_0 | TIM_DCTRL_DBADDR_4)
#define TIM_DMABASE_CNT                     (TIM_DCTRL_DBADDR_1 | TIM_DCTRL_DBADDR_4)
#define TIM_DMABASE_REPCNT                  (TIM_DCTRL_DBADDR_0 | TIM_DCTRL_DBADDR_1 | TIM_DCTRL_DBADDR_4)
#define TIM_DMABASE_BKDT                    (TIM_DCTRL_DBADDR_2 | TIM_DCTRL_DBADDR_4)
#define TIM_DMABASE_CAPCMPDAT7              (TIM_DCTRL_DBADDR_0 | TIM_DCTRL_DBADDR_2 | TIM_DCTRL_DBADDR_4)
#define TIM_DMABASE_BKFR                    (TIM_DCTRL_DBADDR_3 | TIM_DCTRL_DBADDR_4)
#define TIM_DMABASE_C1FILT                  (TIM_DCTRL_DBADDR_0 | TIM_DCTRL_DBADDR_3 | TIM_DCTRL_DBADDR_4)
#define TIM_DMABASE_C2FILT                  (TIM_DCTRL_DBADDR_1 | TIM_DCTRL_DBADDR_3 | TIM_DCTRL_DBADDR_4)
#define TIM_DMABASE_C3FILT                  (TIM_DCTRL_DBADDR_0 | TIM_DCTRL_DBADDR_1 | TIM_DCTRL_DBADDR_3 | TIM_DCTRL_DBADDR_4)
#define TIM_DMABASE_FILTO                   (TIM_DCTRL_DBADDR_0 | TIM_DCTRL_DBADDR_2 | TIM_DCTRL_DBADDR_3 | TIM_DCTRL_DBADDR_4)
#define TIM_DMABASE_AF1                     (TIM_DCTRL_DBADDR_0 | TIM_DCTRL_DBADDR_1 | TIM_DCTRL_DBADDR_2 | TIM_DCTRL_DBADDR_3 | TIM_DCTRL_DBADDR_4)
#define TIM_DMABASE_ENCDAT                  (TIM_DCTRL_DBADDR_1 | TIM_DCTRL_DBADDR_5)
#define TIM_DMABASE_ENCMCTRL                (TIM_DCTRL_DBADDR_0 | TIM_DCTRL_DBADDR_1 | TIM_DCTRL_DBADDR_5)
#define TIM_DMABASE_ENCLVR                  (TIM_DCTRL_DBADDR_2 | TIM_DCTRL_DBADDR_5)

/** TIM_DMA_Burst_Length **/
#define TIM_DMABURST_LENGTH_1TRANSFER       (TIM_REG_BIT_MASK)
#define TIM_DMABURST_LENGTH_2TRANSFERS      (TIM_DCTRL_DBLEN_0)
#define TIM_DMABURST_LENGTH_3TRANSFERS      (TIM_DCTRL_DBLEN_1)
#define TIM_DMABURST_LENGTH_4TRANSFERS      (TIM_DCTRL_DBLEN_0 | TIM_DCTRL_DBLEN_1)
#define TIM_DMABURST_LENGTH_5TRANSFERS      (TIM_DCTRL_DBLEN_2)
#define TIM_DMABURST_LENGTH_6TRANSFERS      (TIM_DCTRL_DBLEN_0 | TIM_DCTRL_DBLEN_2)
#define TIM_DMABURST_LENGTH_7TRANSFERS      (TIM_DCTRL_DBLEN_1 | TIM_DCTRL_DBLEN_2)
#define TIM_DMABURST_LENGTH_8TRANSFERS      (TIM_DCTRL_DBLEN_0 | TIM_DCTRL_DBLEN_1 | TIM_DCTRL_DBLEN_2)
#define TIM_DMABURST_LENGTH_9TRANSFERS      (TIM_DCTRL_DBLEN_3)
#define TIM_DMABURST_LENGTH_10TRANSFERS     (TIM_DCTRL_DBLEN_0 | TIM_DCTRL_DBLEN_3)
#define TIM_DMABURST_LENGTH_11TRANSFERS     (TIM_DCTRL_DBLEN_1 | TIM_DCTRL_DBLEN_3)
#define TIM_DMABURST_LENGTH_12TRANSFERS     (TIM_DCTRL_DBLEN_0 | TIM_DCTRL_DBLEN_1 | TIM_DCTRL_DBLEN_3)
#define TIM_DMABURST_LENGTH_13TRANSFERS     (TIM_DCTRL_DBLEN_2 | TIM_DCTRL_DBLEN_3)
#define TIM_DMABURST_LENGTH_14TRANSFERS     (TIM_DCTRL_DBLEN_0 | TIM_DCTRL_DBLEN_2 | TIM_DCTRL_DBLEN_3)
#define TIM_DMABURST_LENGTH_15TRANSFERS     (TIM_DCTRL_DBLEN_1 | TIM_DCTRL_DBLEN_2 | TIM_DCTRL_DBLEN_3)
#define TIM_DMABURST_LENGTH_16TRANSFERS     (TIM_DCTRL_DBLEN_0 | TIM_DCTRL_DBLEN_1 | TIM_DCTRL_DBLEN_2 | TIM_DCTRL_DBLEN_3)
#define TIM_DMABURST_LENGTH_17TRANSFERS     (TIM_DCTRL_DBLEN_4)
#define TIM_DMABURST_LENGTH_18TRANSFERS     (TIM_DCTRL_DBLEN_0 | TIM_DCTRL_DBLEN_4)
#define TIM_DMABURST_LENGTH_19TRANSFERS     (TIM_DCTRL_DBLEN_1 | TIM_DCTRL_DBLEN_4)
#define TIM_DMABURST_LENGTH_20TRANSFERS     (TIM_DCTRL_DBLEN_0 | TIM_DCTRL_DBLEN_1 | TIM_DCTRL_DBLEN_4)
#define TIM_DMABURST_LENGTH_21TRANSFERS     (TIM_DCTRL_DBLEN_2 | TIM_DCTRL_DBLEN_4)
#define TIM_DMABURST_LENGTH_22TRANSFERS     (TIM_DCTRL_DBLEN_0 | TIM_DCTRL_DBLEN_2 | TIM_DCTRL_DBLEN_4)
#define TIM_DMABURST_LENGTH_23TRANSFERS     (TIM_DCTRL_DBLEN_1 | TIM_DCTRL_DBLEN_2 | TIM_DCTRL_DBLEN_4)
#define TIM_DMABURST_LENGTH_24TRANSFERS     (TIM_DCTRL_DBLEN_0 | TIM_DCTRL_DBLEN_1 | TIM_DCTRL_DBLEN_2 | TIM_DCTRL_DBLEN_4)
#define TIM_DMABURST_LENGTH_25TRANSFERS     (TIM_DCTRL_DBLEN_3 | TIM_DCTRL_DBLEN_4)
#define TIM_DMABURST_LENGTH_26TRANSFERS     (TIM_DCTRL_DBLEN_0 | TIM_DCTRL_DBLEN_3 | TIM_DCTRL_DBLEN_4)
#define TIM_DMABURST_LENGTH_27TRANSFERS     (TIM_DCTRL_DBLEN_1 | TIM_DCTRL_DBLEN_3 | TIM_DCTRL_DBLEN_4)
#define TIM_DMABURST_LENGTH_28TRANSFERS     (TIM_DCTRL_DBLEN_0 | TIM_DCTRL_DBLEN_1 | TIM_DCTRL_DBLEN_3 | TIM_DCTRL_DBLEN_4)
#define TIM_DMABURST_LENGTH_29TRANSFERS     (TIM_DCTRL_DBLEN_2 | TIM_DCTRL_DBLEN_3 | TIM_DCTRL_DBLEN_4)
#define TIM_DMABURST_LENGTH_30TRANSFERS     (TIM_DCTRL_DBLEN_0 | TIM_DCTRL_DBLEN_2 | TIM_DCTRL_DBLEN_3 | TIM_DCTRL_DBLEN_4)
#define TIM_DMABURST_LENGTH_31TRANSFERS     (TIM_DCTRL_DBLEN_1 | TIM_DCTRL_DBLEN_2 | TIM_DCTRL_DBLEN_3 | TIM_DCTRL_DBLEN_4)
#define TIM_DMABURST_LENGTH_32TRANSFERS     (TIM_DCTRL_DBLEN_0 | TIM_DCTRL_DBLEN_1 | TIM_DCTRL_DBLEN_2 | TIM_DCTRL_DBLEN_3 | TIM_DCTRL_DBLEN_4)
#define TIM_DMABURST_LENGTH_33TRANSFERS     (TIM_DCTRL_DBLEN_5)
#define TIM_DMABURST_LENGTH_34TRANSFERS     (TIM_DCTRL_DBLEN_0 | TIM_DCTRL_DBLEN_5)
#define TIM_DMABURST_LENGTH_35TRANSFERS     (TIM_DCTRL_DBLEN_1 | TIM_DCTRL_DBLEN_5)
#define TIM_DMABURST_LENGTH_36TRANSFERS     (TIM_DCTRL_DBLEN_0 | TIM_DCTRL_DBLEN_1 | TIM_DCTRL_DBLEN_5)
#define TIM_DMABURST_LENGTH_37TRANSFERS     (TIM_DCTRL_DBLEN_2 | TIM_DCTRL_DBLEN_5)

/** TIM_DMA_sources **/
#define TIM_DMA_CC1                         (TIM_DINTEN_CC1DEN)
#define TIM_DMA_CC2                         (TIM_DINTEN_CC2DEN)
#define TIM_DMA_CC3                         (TIM_DINTEN_CC3DEN)
#define TIM_DMA_CC4                         (TIM_DINTEN_CC4DEN)
#define TIM_DMA_UPDATE                      (TIM_DINTEN_UDEN)
#define TIM_DMA_COM                         (TIM_DINTEN_COMDEN)
#define TIM_DMA_TRIG                        (TIM_DINTEN_TDEN)

/** TIM_Slave_Mode **/
#define TIM_SLAVE_MODE_DISABLE              (TIM_REG_BIT_MASK)
#define TIM_SLAVE_MODE_RESET                (TIM_SMCTRL_SMSEL_2)
#define TIM_SLAVE_MODE_GATED                (TIM_SMCTRL_SMSEL_0 | TIM_SMCTRL_SMSEL_2)
#define TIM_SLAVE_MODE_TRIG                 (TIM_SMCTRL_SMSEL_1 | TIM_SMCTRL_SMSEL_2)
#define TIM_SLAVE_MODE_EXT1                 (TIM_SMCTRL_SMSEL_0 | TIM_SMCTRL_SMSEL_1 | TIM_SMCTRL_SMSEL_2)
#define TIM_SLAVE_MODE_GATED_RESET          (TIM_SMCTRL_SMSEL_0 | TIM_SMCTRL_SMSEL_2 | TIM_SMCTRL_SMSEL_3)
#define TIM_SLAVE_MODE_TRIG_RESET           (TIM_SMCTRL_SMSEL_1 | TIM_SMCTRL_SMSEL_2 | TIM_SMCTRL_SMSEL_3)

/** TIM_EncoderMode **/
#define TIM_ENCODE_QUA_MODE_TI1             (TIM_SMCTRL_SMSEL_0)    
#define TIM_ENCODE_QUA_MODE_TI2             (TIM_SMCTRL_SMSEL_1)
#define TIM_ENCODE_QUA_MODE_TI12            (TIM_SMCTRL_SMSEL_0 | TIM_SMCTRL_SMSEL_1)

