2zzyyyq/3C/n32g033_std_periph_driver/inc/n32g033_tim.h
/** TIM_Encoder2Mode **/
#define TIM_ENCODE2_QUA_MODE_TI1             (TIM_ENCMCTRL_ENCMD_0)    
#define TIM_ENCODE2_QUA_MODE_TI2             (TIM_ENCMCTRL_ENCMD_1)
#define TIM_ENCODE2_QUA_MODE_TI12            (TIM_ENCMCTRL_ENCMD_0 | TIM_ENCMCTRL_ENCMD_1)
#define TIM_ENCODE2_QUA_MODE_SINGLE_TI1      (TIM_ENCMCTRL_ENCMD_2)
#define TIM_ENCODE2_QUA_MODE_SINGLE_TI2      (TIM_ENCMCTRL_ENCMD_0 | TIM_ENCMCTRL_ENCMD_2)
#define TIM_ENCODE2_DUL_CLKPLUS_MODE1        (TIM_ENCMCTRL_ENCMD_1 | TIM_ENCMCTRL_ENCMD_3)
#define TIM_ENCODE2_DUL_CLKPLUS_MODE2        (TIM_ENCMCTRL_ENCMD_0 | TIM_ENCMCTRL_ENCMD_1 | TIM_ENCMCTRL_ENCMD_3)    
#define TIM_ENCODE2_SINGLE_CLKPLUS_MODE1     (TIM_ENCMCTRL_ENCMD_1 | TIM_ENCMCTRL_ENCMD_2)
#define TIM_ENCODE2_SINGLE_CLKPLUS_MODE2     (TIM_ENCMCTRL_ENCMD_0 | TIM_ENCMCTRL_ENCMD_1 | TIM_ENCMCTRL_ENCMD_2) 
#define TIM_ENCODE2_CCW_MODE1                (TIM_ENCMCTRL_ENCMD_3) 
#define TIM_ENCODE2_CCW_MODE2                (TIM_ENCMCTRL_ENCMD_0 | TIM_ENCMCTRL_ENCMD_3)


/** TIM_Output_Compare_Preload_State **/
#define TIM_OC_PRE_LOAD_ENABLE             (TIM_CCMOD1_OC1PEN)
#define TIM_OC_PRE_LOAD_DISABLE            (TIM_REG_BIT_MASK)

/** TIM_Output_Compare_Fast_State **/
#define TIM_OC_FAST_ENABLE                 (TIM_CCMOD1_OC1FEN)
#define TIM_OC_FAST_DISABLE                (TIM_REG_BIT_MASK)

/** TIM_Output_Compare_Clear_State **/
#define TIM_OC_CLR_ENABLE                   (TIM_CCMOD1_OC1CEN)
#define TIM_OC_CLR_DISABLE                  (TIM_REG_BIT_MASK)

/** Capture compare enable **/
#define CAPCMPEN_CCE_SET                    (TIM_CCEN_CC1EN)
#define CAPCMPEN_CCNE_SET                   (TIM_CCEN_CC1NEN)

/** TIM_Capture_Compare_state **/
#define TIM_CAP_CMP_ENABLE                  (TIM_CCEN_CC1EN)
#define TIM_CAP_CMP_DISABLE                 (TIM_REG_BIT_MASK)

/** TIM_Capture_Compare_N_state **/
#define TIM_CAP_CMP_N_ENABLE                (TIM_CCEN_CC1NEN)
#define TIM_CAP_CMP_N_DISABLE               (TIM_REG_BIT_MASK)

/** TIMx_CCOMD1 register address offset **/
#define CAPCMPMOD_OFFSET                    ((uint32_t)0x00000018)

/** TIM_Update_Source **/
#define TIM_UPDATE_SRC_GLOBAL               (TIM_REG_BIT_MASK) /* Source of update is the counter overflow/underflow \
                                                                 or the setting of UG bit, or an update generation \
                                                                 through the slave mode controller. */
#define TIM_UPDATE_SRC_REGULAR              (TIM_CTRL1_UPRS) /* Source of update is counter overflow/underflow. */

/** TIM_One_Pulse_Mode **/
#define TIM_OPMODE_SINGLE                   (TIM_CTRL1_ONEPM)
#define TIM_OPMODE_REPET                    (TIM_REG_BIT_MASK)

/** TIM_Trigger_Output_Source **/
#define TIM_TRGO_SRC_RESET                  (TIM_REG_BIT_MASK)
#define TIM_TRGO_SRC_ENABLE                 (TIM_CTRL2_MMSEL_0)
#define TIM_TRGO_SRC_UPDATE                 (TIM_CTRL2_MMSEL_1)
#define TIM_TRGO_SRC_OC1                    (TIM_CTRL2_MMSEL_0 | TIM_CTRL2_MMSEL_1)
#define TIM_TRGO_SRC_OC1REF                 (TIM_CTRL2_MMSEL_2)
#define TIM_TRGO_SRC_OC2REF                 (TIM_CTRL2_MMSEL_0 | TIM_CTRL2_MMSEL_2)
#define TIM_TRGO_SRC_OC3REF                 (TIM_CTRL2_MMSEL_1 | TIM_CTRL2_MMSEL_2)
#define TIM_TRGO_SRC_OC4REF                 (TIM_CTRL2_MMSEL_0 | TIM_CTRL2_MMSEL_1 | TIM_CTRL2_MMSEL_2)
#define TIM_TRGO_SRC_OC5REF                 (TIM_CTRL2_MMSEL_0 | TIM_CTRL2_MMSEL_3)
#define TIM_TRGO_SRC_OC6REF                 (TIM_CTRL2_MMSEL_1 | TIM_CTRL2_MMSEL_3)
#define TIM_TRGO_SRC_OC7REF                 (TIM_CTRL2_MMSEL_0 | TIM_CTRL2_MMSEL_1 | TIM_CTRL2_MMSEL_3)

/** TIM_Master_Slave_Mode **/
#define TIM_MASTER_SLAVE_MODE_ENABLE        (TIM_SMCTRL_MSMD)
#define TIM_MASTER_SLAVE_MODE_DISABLE       (TIM_REG_BIT_MASK)

/** TIM_Legacy **/
#define TIM_CC1EN                           (TIM_CCEN_CC1EN)
#define TIM_CC1NEN                          (TIM_CCEN_CC1NEN)
#define TIM_CC2EN                           (TIM_CCEN_CC2EN)
#define TIM_CC2NEN                          (TIM_CCEN_CC2NEN)
#define TIM_CC3EN                           (TIM_CCEN_CC3EN)
#define TIM_CC3NEN                          (TIM_CCEN_CC3NEN)
#define TIM_CC4EN                           (TIM_CCEN_CC4EN)
#define TIM_CC4NEN                          (TIM_CCEN_CC4NEN)
#define TIM_CC5EN                           (TIM_CCEN_CC5EN)
#define TIM_CC6EN                           (TIM_CCEN_CC6EN)
#define TIM_CC7EN                           (TIM_CCEN_CC7EN)

/** TIM_Flags **/
#define TIM_FLAG_CC1                        (TIM_STS_CC1ITF)
#define TIM_FLAG_CC2                        (TIM_STS_CC2ITF)
#define TIM_FLAG_CC3                        (TIM_STS_CC3ITF)
#define TIM_FLAG_CC4                        (TIM_STS_CC4ITF)
#define TIM_FLAG_CC5                        (TIM_STS_CC5ITF)
#define TIM_FLAG_CC6                        (TIM_STS_CC6ITF)
#define TIM_FLAG_CC7                        (TIM_STS_CC7ITF)
#define TIM_FLAG_CC1OF                      (TIM_STS_CC1OCF)
#define TIM_FLAG_CC2OF                      (TIM_STS_CC2OCF)
#define TIM_FLAG_CC3OF                      (TIM_STS_CC3OCF)
#define TIM_FLAG_CC4OF                      (TIM_STS_CC4OCF)
#define TIM_FLAG_UPDATE                     (TIM_STS_UDITF)
#define TIM_FLAG_COM                        (TIM_STS_COMITF)
#define TIM_FLAG_TRIG                       (TIM_STS_TITF)
#define TIM_FLAG_BREAK                      (TIM_STS_BITF)
#define TIM_FLAG_LBKP                       (TIM_STS_LBKPITF)
#define TIM_FLAG_PBKP                       (TIM_STS_PBKITF)
#define TIM_FLAG_COMP                       (TIM_STS_COMPBITF)
#define TIM_FLAG_IOM                        (TIM_STS_IOMBITF)
#define TIM_FLAG_C3LDCNT                    (TIM_STS_C3LDCNTITF)

/** TIM_CH3_Trgi_LVR_Polarity **/
#define TIM_CH3_POLARITY_HIGH               (TIM_REG_BIT_MASK)
#define TIM_CH3_POLARITY_LOW                (TIM_ENCMCTRL_C3LDCNTSEL_0)
#define TIM_CH3_POLARITY_RISING             (TIM_ENCMCTRL_C3LDCNTSEL_1)
#define TIM_CH3_POLARITY_FALLING            (TIM_ENCMCTRL_C3LDCNTSEL_0 | TIM_ENCMCTRL_C3LDCNTSEL_1)

