2zzyyyq/3C/n32g033_std_periph_driver/inc/n32g033_tim.h
/** TIM_Flags **/
#define TIM_C1FILTO                         (TIM_FILTO_C1FILTO)
#define TIM_C2FILTO                         (TIM_FILTO_C2FILTO)
#define TIM_C3FILTO                         (TIM_FILTO_C3FILTO)


void TIM_DeInit(TIM_Module* TIM_OUTPWM);
void TIM_InitTimeBase(TIM_Module* TIM_OUTPWM, TIM_TimeBaseInitType* TIM_TimeBaseInitStruct);
void TIM_InitOc1(TIM_Module* TIM_OUTPWM, OCInitType* TIM_OCInitStruct);
void TIM_InitOc2(TIM_Module* TIM_OUTPWM, OCInitType* TIM_OCInitStruct);
void TIM_InitOc3(TIM_Module* TIM_OUTPWM, OCInitType* TIM_OCInitStruct);
void TIM_InitOc4(TIM_Module* TIM_OUTPWM, OCInitType* TIM_OCInitStruct);
void TIM_InitOc5(TIM_Module* TIM_OUTPWM, OCInitType* TIM_OCInitStruct);
void TIM_InitOc6(TIM_Module* TIM_OUTPWM, OCInitType* TIM_OCInitStruct);
void TIM_InitOc7(TIM_Module* TIM_OUTPWM, OCInitType* TIM_OCInitStruct);
void TIM_ICInit(TIM_Module* TIM_OUTPWM, TIM_ICInitType* TIM_ICInitStruct);
void TIM_ConfigPwmIc(TIM_Module* TIM_OUTPWM, TIM_ICInitType* TIM_ICInitStruct);
void TIM_ConfigBkdt(TIM_Module* TIM_OUTPWM, TIM_BDTRInitType* TIM_BDTRInitStruct);
void TIM_BreakFiltConfig(TIM_Module* TIM_OUTPWM, TIM_FiltInitType* TIM_FiltInitStruct);
void TIM_BreakFiltEnable(TIM_Module* TIM_OUTPWM,FunctionalState Cmd);
void TIM_BreakInputSourceEnable(TIM_Module* TIM_OUTPWM, uint32_t Source, uint32_t Polarity, FunctionalState Cmd);
void TIM_InitTimBaseStruct(TIM_TimeBaseInitType* TIM_TimeBaseInitStruct);
void TIM_InitOcStruct(OCInitType* TIM_OCInitStruct);
void TIM_InitIcStruct(TIM_ICInitType* TIM_ICInitStruct);
void TIM_InitBkdtStruct(TIM_BDTRInitType* TIM_BDTRInitStruct);
void TIM_Enable(TIM_Module* TIM_OUTPWM, FunctionalState Cmd);
void TIM_EnableCtrlPwmOutputs(TIM_Module* TIM_OUTPWM, FunctionalState Cmd);
void TIM_ConfigInt(TIM_Module* TIM_OUTPWM, uint32_t TIM_IT, FunctionalState Cmd);
void TIM_GenerateEvent(TIM_Module* TIM_OUTPWM, uint32_t TIM_EventSource);
void TIM_ConfigDma(TIM_Module* TIM_OUTPWM, uint32_t TIM_DMABase, uint32_t TIM_DMABurstLength);
void TIM_EnableDma(TIM_Module* TIM_OUTPWM, uint32_t TIM_DMASource, FunctionalState Cmd);
void TIM_ConfigInternalClk(TIM_Module* TIM_OUTPWM);
void TIM_ConfigInternalTrigToExt(TIM_Module* TIM_OUTPWM, uint32_t TIM_InputTriggerSource);
void TIM_ConfigExtTrigAsClk(TIM_Module* TIM_OUTPWM, uint32_t TIM_TIxExternalCLKSource, uint32_t IcPolarity, uint32_t ICFilter);
void TIM_ConfigExtClkMode1(TIM_Module* TIM_OUTPWM,uint32_t TIM_ExtTRGPrescaler,uint32_t TIM_ExtTRGPolarity,uint32_t ExtTRGFilter);
void TIM_ConfigExtClkMode2(TIM_Module* TIM_OUTPWM,uint32_t TIM_ExtTRGPrescaler,uint32_t TIM_ExtTRGPolarity,uint32_t ExtTRGFilter);
void TIM_ConfigPrescaler(TIM_Module* TIM_OUTPWM, uint32_t Prescaler, uint32_t TIM_PSCReloadMode);
void TIM_ConfigCntMode(TIM_Module* TIM_OUTPWM, uint32_t CntMode);
void TIM_ConfigEncoderInterface(TIM_Module* TIM_OUTPWM,uint32_t TIM_EncoderMode,uint32_t TIM_IC1Polarity,uint32_t TIM_IC2Polarity);
void TIM_ConfigEncoderInterface2(TIM_Module* TIM_OUTPWM,uint32_t TIM_EncoderMode,uint32_t TIM_IC1Polarity,uint32_t TIM_IC2Polarity);
void TIM_ConfigForcedOc1(TIM_Module* TIM_OUTPWM, uint32_t TIM_ForcedAction);
void TIM_ConfigForcedOc2(TIM_Module* TIM_OUTPWM, uint32_t TIM_ForcedAction);
void TIM_ConfigForcedOc3(TIM_Module* TIM_OUTPWM, uint32_t TIM_ForcedAction);
void TIM_ConfigForcedOc4(TIM_Module* TIM_OUTPWM, uint32_t TIM_ForcedAction);
void TIM_ConfigForcedOc5(TIM_Module* TIM_OUTPWM, uint32_t TIM_ForcedAction);
void TIM_ConfigForcedOc6(TIM_Module* TIM_OUTPWM, uint32_t TIM_ForcedAction);
void TIM_ConfigForcedOc7(TIM_Module* TIM_OUTPWM, uint32_t TIM_ForcedAction);
void TIM_ConfigArPreload(TIM_Module* TIM_OUTPWM, FunctionalState Cmd);
void TIM_SelectComEvt(TIM_Module* TIM_OUTPWM, FunctionalState Cmd);
void TIM_SelectCapCmpDmaSrc(TIM_Module* TIM_OUTPWM, FunctionalState Cmd);
void TIM_EnableCapCmpPreloadControl(TIM_Module* TIM_OUTPWM, FunctionalState Cmd);
void TIM_ConfigOc1Preload(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCPreload);
void TIM_ConfigOc2Preload(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCPreload);
void TIM_ConfigOc3Preload(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCPreload);
void TIM_ConfigOc4Preload(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCPreload);
void TIM_ConfigOc5Preload(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCPreload);
void TIM_ConfigOc6Preload(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCPreload);
void TIM_ConfigOc7Preload(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCPreload);
void TIM_ConfigOc1Fast(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCFast);
void TIM_ConfigOc2Fast(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCFast);
void TIM_ConfigOc3Fast(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCFast);
void TIM_ConfigOc4Fast(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCFast);
void TIM_ConfigOc5Fast(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCFast);
void TIM_ConfigOc6Fast(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCFast);
void TIM_ConfigOc7Fast(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCFast);
void TIM_ClrOc1Ref(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCClear);
void TIM_ClrOc2Ref(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCClear);
void TIM_ClrOc3Ref(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCClear);
void TIM_ClrOc4Ref(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCClear);
void TIM_ClrOc5Ref(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCClear);
void TIM_ClrOc6Ref(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCClear);
void TIM_ClrOc7Ref(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCClear);
void TIM_ClrOcRefInputSource(TIM_Module* TIM_OUTPWM, uint32_t OCRefClearInputSource);
void TIM_ConfigOc1Polarity(TIM_Module* TIM_OUTPWM, uint32_t OcPolarity);
void TIM_ConfigOc1NPolarity(TIM_Module* TIM_OUTPWM, uint32_t OcNPolarity);
void TIM_ConfigOc2Polarity(TIM_Module* TIM_OUTPWM, uint32_t OcPolarity);
void TIM_ConfigOc2NPolarity(TIM_Module* TIM_OUTPWM, uint32_t OcNPolarity);
void TIM_ConfigOc3Polarity(TIM_Module* TIM_OUTPWM, uint32_t OcPolarity);
void TIM_ConfigOc3NPolarity(TIM_Module* TIM_OUTPWM, uint32_t OcNPolarity);
void TIM_ConfigOc4Polarity(TIM_Module* TIM_OUTPWM, uint32_t OcPolarity);
void TIM_ConfigOc4NPolarity(TIM_Module* TIM_OUTPWM, uint32_t OcNPolarity);
void TIM_ConfigOc5Polarity(TIM_Module* TIM_OUTPWM, uint32_t OcPolarity);
void TIM_ConfigOc6Polarity(TIM_Module* TIM_OUTPWM, uint32_t OcPolarity);
void TIM_ConfigOc7Polarity(TIM_Module* TIM_OUTPWM, uint32_t OcPolarity);
void TIM_EnableCapCmpCh(TIM_Module* TIM_OUTPWM, uint32_t Channel, uint32_t TIM_CCx);
void TIM_EnableCapCmpChN(TIM_Module* TIM_OUTPWM, uint32_t Channel, uint32_t TIM_CCxN);
void TIM_SelectOcMode(TIM_Module* TIM_OUTPWM, uint32_t Channel, uint32_t OcMode);
void TIM_EnableUpdateEvt(TIM_Module* TIM_OUTPWM, FunctionalState Cmd);
void TIM_ConfigUpdateEvt(TIM_Module* TIM_OUTPWM, FunctionalState Cmd);
void TIM_ConfigUpdateRequestIntSrc(TIM_Module* TIM_OUTPWM, uint32_t TIM_UpdateSource);
void TIM_SelectHallSensor(TIM_Module* TIM_OUTPWM, FunctionalState Cmd);
void TIM_SelectOnePulseMode(TIM_Module* TIM_OUTPWM, uint32_t TIM_OPMode);
void TIM_SelectOutputTrig(TIM_Module* TIM_OUTPWM, uint32_t TIM_TRGOSource);
void TIM_SelectSlaveMode(TIM_Module* TIM_OUTPWM, uint32_t TIM_SlaveMode);
void TIM_SelectMasterSlaveMode(TIM_Module* TIM_OUTPWM, uint32_t TIM_MasterSlaveMode);
void TIM_SetCnt(TIM_Module* TIM_OUTPWM, uint32_t Counter);
void TIM_SetAutoReload(TIM_Module* TIM_OUTPWM, uint32_t Autoreload);
void TIM_SetCmp1(TIM_Module* TIM_OUTPWM, uint32_t Compare1);
void TIM_SetCmp2(TIM_Module* TIM_OUTPWM, uint32_t Compare2);
void TIM_SetCmp3(TIM_Module* TIM_OUTPWM, uint32_t Compare3);
void TIM_SetCmp4(TIM_Module* TIM_OUTPWM, uint16_t Compare4);
void TIM_SetCmp5(TIM_Module* TIM_OUTPWM, uint16_t Compare5);
void TIM_SetCmp6(TIM_Module* TIM_OUTPWM, uint16_t Compare6);
void TIM_SetCmp7(TIM_Module* TIM_OUTPWM, uint16_t Compare7);
void TIM_SetCmp1D(TIM_Module* TIM_OUTPWM, uint16_t compare1D);
void TIM_SetCmp2D(TIM_Module* TIM_OUTPWM, uint16_t compare2D);
void TIM_SetCmp3D(TIM_Module* TIM_OUTPWM, uint16_t compare3D);
void TIM_SetCmp4D(TIM_Module* TIM_OUTPWM, uint16_t compare4D);
void ConfigTI1(TIM_Module* TIM_OUTPWM, uint32_t ICPolarity, uint32_t ICSelection, uint32_t ICFilter);
void ConfigTI2(TIM_Module* TIM_OUTPWM, uint32_t ICPolarity, uint32_t ICSelection, uint32_t ICFilter);
void ConfigTI3(TIM_Module* TIM_OUTPWM, uint32_t ICPolarity, uint32_t ICSelection, uint32_t ICFilter);
void ConfigTI4(TIM_Module* TIM_OUTPWM, uint32_t ICPolarity, uint32_t ICSelection, uint32_t ICFilter);
void TIM_SetInCap1Prescaler(TIM_Module* TIM_OUTPWM, uint32_t ICPrescaler);
void TIM_SetInCap2Prescaler(TIM_Module* TIM_OUTPWM, uint32_t ICPrescaler);
void TIM_SetInCap3Prescaler(TIM_Module* TIM_OUTPWM, uint32_t ICPrescaler);
void TIM_SetInCap4Prescaler(TIM_Module* TIM_OUTPWM, uint32_t ICPrescaler);
void TIM_SelectInputTrig(TIM_Module* TIM_OUTPWM, uint32_t TIM_InputTriggerSource);
void TIM_ConfigExtTrig(TIM_Module* TIM_OUTPWM,uint32_t TIM_ExtTRGPrescaler,uint32_t TIM_ExtTRGPolarity,uint32_t ExtTRGFilter);
void TIM_SetClkDiv(TIM_Module* TIM_OUTPWM, uint32_t TIM_CKD);
uint32_t TIM_GetCap1(TIM_Module* TIM_OUTPWM);
uint32_t TIM_GetCap2(TIM_Module* TIM_OUTPWM);
uint32_t TIM_GetCap3(TIM_Module* TIM_OUTPWM);
uint16_t TIM_GetCap4(TIM_Module* TIM_OUTPWM);
uint16_t TIM_GetCap5(TIM_Module* TIM_OUTPWM);
uint16_t TIM_GetCap6(TIM_Module* TIM_OUTPWM);
uint16_t TIM_GetCap7(TIM_Module* TIM_OUTPWM);
uint16_t TIM_GetCap1D(TIM_Module* TIM_OUTPWM);
uint16_t TIM_GetCap2D(TIM_Module* TIM_OUTPWM);
uint16_t TIM_GetCap3D(TIM_Module* TIM_OUTPWM);
uint16_t TIM_GetCap4D(TIM_Module* TIM_OUTPWM);
uint32_t TIM_GetCnt(TIM_Module* TIM_OUTPWM);
uint16_t TIM_GetPrescaler(TIM_Module* TIM_OUTPWM);
uint32_t TIM_GetAutoReload(TIM_Module* TIM_OUTPWM);
FlagStatus TIM_GetCCENStatus(TIM_Module* TIM_OUTPWM, uint32_t TIM_CCEN);
FlagStatus TIM_GetFlagStatus(TIM_Module* TIM_OUTPWM, uint32_t TIM_FLAG);
void TIM_ClearFlag(TIM_Module* TIM_OUTPWM, uint32_t TIM_FLAG);
INTStatus TIM_GetIntStatus(TIM_Module* TIM_OUTPWM, uint32_t TIM_IT);
void TIM_ClrIntPendingBit(TIM_Module* TIM_OUTPWM, uint32_t TIM_IT);
void TIM_AsymmetricEnable(TIM_Module* TIM_OUTPWM, FunctionalState Cmd);
void TIM_IC1FiltConfig(TIM_Module* TIM_OUTPWM, TIM_FiltInitType* TIM_FiltInitStruct);
void TIM_IC2FiltConfig(TIM_Module* TIM_OUTPWM, TIM_FiltInitType* TIM_FiltInitStruct);
void TIM_IC3FiltConfig(TIM_Module* TIM_OUTPWM, TIM_FiltInitType* TIM_FiltInitStruct);
void TIM_IC1FiltEnable(TIM_Module* TIM_OUTPWM,FunctionalState Cmd);
void TIM_IC2FiltEnable(TIM_Module* TIM_OUTPWM,FunctionalState Cmd);
void TIM_IC3FiltEnable(TIM_Module* TIM_OUTPWM,FunctionalState Cmd);
FlagStatus TIM_GetFiltStatus(TIM_Module* TIM_OUTPWM, uint32_t TIM_FiltFlag);
void TIM_TrgiLoadLvrToCNTEnable(FunctionalState Cmd);
uint32_t TIM_GetLVR(TIM_Module* TIM_OUTPWM);
void TIM_CH3LoadLvrToCNTEnable(FunctionalState Cmd);
void TIM_CH3LoadLvrToCNTPolarity(uint32_t Polarity);
uint32_t TIM_GetENCDAT(TIM_Module* TIM_OUTPWM);
uint32_t TIM_GetENCDATSign(TIM_Module* TIM_OUTPWM);

/** TIM_Exported_Functions End **/

#ifdef __cplusplus
}

#endif

#endif /*__N32G033_TIM_H */
